app/controllers/api/v1/authentication_controller.rb

  def login
    @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "adil.testing@logicon.com"], ["LIMIT", 1]]