app/controllers/api/v1/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    if @transaction.save
---
INSERT INTO "transactions" ("blockNumber", "timeStamp", "hash", "nonce", "blockHash", "transactionIndex", "gas", "gasPrice", "isError", "txreceipt_status", "input", "contractAddress", "cumulativeGasUsed", "gasUsed", "confirmations", "created_at", "updated_at", "value", "to", "from") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"